openfoam/case_template/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (air soap); 

gapWidth [0 1 0 0 0 0 0] 0.001;

air
{
    transportModel  powerLaw;
    powerLawCoeffs
    {
        nuMax            [ 0 2 -1 0 0 0 0 ] 1;
    	nuMin            [ 0 2 -1 0 0 0 0 ] 1.0e-15;
        k                [ 0 2 -1 0 0 0 0 ] 1.5e-5;         // flow consistency index
        n                [ 0 0 0  0 0 0 0 ] 1;              // flow behaviour index
    }
    rho             rho [1 -3 0 0 0 0 0] 1.2; 
}

soap  
{
    transportModel  powerLaw;
    powerLawCoeffs
    {
        nuMax            [ 0 2 -1 0 0 0 0 ] 1;
    	nuMin            [ 0 2 -1 0 0 0 0 ] 1.0e-15;
        k                [ 0 2 -1 0 0 0 0 ] 2e-3;           // flow consistency index
        n                [ 0 0 0  0 0 0 0 ] 1;              // flow behaviour index
    }
    rho             rho [1 -3 0 0 0 0 0] 1026.6;        
}

sigma          sigma [1 0 -2  0 0 0 0 ] 0.031;              // Capillary Coefficient


// ************************************************************************* //
