openfoam/case_template/system/blockMeshDict
FoamFile
{
    version     8;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices 
(
 // --- bottom (z = -b/2) 
    ( 0.0015 0 -0.0005 ) // 0 
    ( 0 0.0015 -0.0005 ) // 1 
    ( -0.0015 0 -0.0005 ) // 2
    ( 0 -0.0015 -0.0005 ) // 3 
    ( 0.095 0 -0.0005 ) // 4 
    ( 0 0.095 -0.0005 ) // 5 
    ( -0.095 0 -0.0005 ) // 6 
    ( 0 -0.095 -0.0005 ) // 7 
             
 // --- top (z = +b/2) 
    ( 0.0015 0 0.0005 ) // 8 
    ( 0 0.0015 0.0005 ) // 9 
    ( -0.0015 0 0.0005 ) // 10 
    ( 0 -0.0015 0.0005 ) // 11 
    ( 0.095 0 0.0005 ) // 12 
    ( 0 0.095 0.0005 ) // 13 
    ( -0.095 0 0.0005 ) // 14 
    ( 0 -0.095 0.0005 ) // 15 
);		

blocks 
( 
    hex (0 4 5 1 8 12 13 9) (60 60 1) simpleGrading (1 1 1) 
    hex (1 5 6 2 9 13 14 10) (60 60 1) simpleGrading (1 1 1) 
    hex (2 6 7 3 10 14 15 11) (60 60 1) simpleGrading (1 1 1) 
    hex (3 7 4 0 11 15 12 8) (60 60 1) simpleGrading (1 1 1) 
);

edges
(
    // inner circle bottom
    arc 0 1 ( 0.0010606601717798212 0.0010606601717798212 -0.0005 )
    arc 1 2 ( -0.0010606601717798212 0.0010606601717798212 -0.0005 )
    arc 2 3 ( -0.0010606601717798212 -0.0010606601717798212 -0.0005 )
    arc 3 0 ( 0.0010606601717798212 -0.0010606601717798212 -0.0005 )
             
    // outer circle bottom
    arc 4 5 ( 0.06717514421272201 0.06717514421272201 -0.0005 ) 
    arc 5 6 ( -0.06717514421272201 0.06717514421272201 -0.0005 )
    arc 6 7 ( -0.06717514421272201 -0.06717514421272201 -0.0005 ) 
    arc 7 4 ( 0.06717514421272201 -0.06717514421272201 -0.0005 )
             
    // inner circle top
    arc 8 9 ( 0.0010606601717798212 0.0010606601717798212 0.0005 ) 
    arc 9 10 ( -0.0010606601717798212 0.0010606601717798212 0.0005 ) 
    arc 10 11 ( -0.0010606601717798212 -0.0010606601717798212 0.0005 ) 
    arc 11 8 ( 0.0010606601717798212 -0.0010606601717798212 0.0005 ) 
             
    // outer circle top 
    arc 12 13 ( 0.06717514421272201 0.06717514421272201 0.0005 ) 
    arc 13 14 ( -0.06717514421272201 0.06717514421272201 0.0005 ) 
    arc 14 15 ( -0.06717514421272201 -0.06717514421272201 0.0005 ) 
    arc 15 12 ( 0.06717514421272201 -0.06717514421272201 0.0005 ) 
);

patches
( 
    patch inlet
    ( 
        (0 1 9 8) 
        (1 2 10 9)
        (2 3 11 10) 
        (3 0 8 11) 
    ) 
             
    patch outlet 
    ( 
        (4 5 13 12) 
        (5 6 14 13) 
        (6 7 15 14) 
        (7 4 12 15) 
    ) 
             
    wall plates 
    ( 
        (0 4 5 1)
        (1 5 6 2)
        (2 6 7 3) 
        (3 7 4 0)
        (8 9 13 12)
        (9 10 14 13)
        (10 11 15 14)
        (11 8 12 15) 
    ) 
);


