openfoam/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     heleShawFoam; 

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         15;   

deltaT          0.1;  

writeControl    adjustableRunTime;

writeInterval   0.05; 

purgeWrite      0;

writeFormat     ascii;

writePrecision  6; 

writeCompression off;

timeFormat      general;

timePrecision   6; 

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.5;

maxAlphaCo      0.5;

maxDeltaT       1;

functions
{
  residuals 
  {
    type           residuals;
    fields (p_rgh U);
  }

}
// ************************************************************************* //
