openfoam/case_template/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.air 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    cylinderToCell
    {
        p1 (0 0 -0.0012);
        p2 (0 0 0.0012);
        radius 0.0025;

        fieldValues
        (
            volScalarFieldValue alpha.air 1
        );
    }
);


// ************************************************************************* //
